neg_kws = "没有收藏价值|戴起来难看|不上档次|性价比低|一无是处|材质不行|很low|无功无过|档次不够|不伦不类|太Low|小家子气|材质不好" \
        "|没有质感|美中不足|差强人意|过于复杂|一言难尽|态度不好|不舒服|走得慢|看不上|不耐磨|超公价|被腐蚀|不耐烦|易磨损|档次低|走的慢" \
        "|不合适|不稳定|有味道|轻飘飘|走的快|不值得|易变形|易腐蚀|不习惯|不喜欢|不好买|不及时|没啥用|不积极|比不上|有点紧|有异味|没必要" \
        "|等太久|价格高|太大了|不对称|来回晃|效果差|不推荐|那么贵|不经用|走得快|不精准|容易坏|买不到|不靠谱|材质硬|不耐用|表盘碎|没好看" \
        "|排不上|不满意|轻很多|不协调|易刮花|太紧了|误差大|排不到|有点松|尺寸大|不防水|尺寸小|有点厚|有点歪|不好看|Low|不划算|有误差" \
        "|质感差|太宽|贵了|无语|落伍|磨损|刮伤|很差|瑕疵|磨手|破皮|脆弱|惊人|弄花|刮花|很大|太重|倒数|进水|凹陷|很小|偏小|不准|靠后|显粗" \
        "|太轻|太大|厚重|磨破|太沖|垃圾|极差|低端|老气|停产|老旧|不搭|别扭|落后|破了|倒卖|划痕|难买|显娘|显黑|廉价|不正|歪的|虚高|偏大" \
        "|划伤|很松|磨花|太沉|太厚|松动|难看|没货|歪了|一般|碎了|太娘|掉价|掉皮|陈旧|不值|太小|磨坏|太长|松了|易碎|普通|拖拉|易脏|搭售" \
        "|刮痕|压手|拔草|平凡|易坏|浮夸|硬|丑|脆|有些娘|不是一个层次|screw|别买|太土了|手腕发黑|太难了|炒剩饭|不敢开评论|不香了|show off" \
        "|“装”的成分|打败|差距|这么low|没什么用|没被市场认可|放下了几万块|涨价|无gs做得靓|not keen|过于成熟|uncomfortable|不是很喜欢" \
        "|是假的|但不会买|哄抬|价格太低|不舒适|刮手|烂大街|别买|滥大街|侵删|low牌子|low表|手表故障|不要买|备受争议|吊打|每天都能慢|黯然失色" \
        "|不够庄重|太过抢眼|过于花哨|涨价|断货|算不上奢侈品|low爆|没在关注|涂墨不均匀|没有别的东西了|cheap looking|这么low|很丢人|不算很顺遂" \
        "|停工|断货|表盘变色|降低档次|放弃|坑|不咋地|garbage|暴发富|不太喜欢|average taste|是有缺陷|放错位置|本身有问题|hater|怪怪的|炒作" \
        "|总是那几个经典款|动能不足|互骗|low代言|没有底线|不友好|批评|购买者寥寥|真的好贵|走快了|最差|不牛逼|经常慢|炫富|生意没得做|放过我们" \
        "|low|假货|烂大街|不如|变色|起泡|锈蚀|昂贵|废物|不太适合|绝不买|松垮垮|塞的太满|痛批|泼妇|冥顽不灵|酸鸡|故障|低级|误差|缺乏|崩盘|lacks" \
        "|无法保证|停走|酸|不够精致|做工不够|慢了|停摆|暴发户|不保值|走停|had problem|卖力吹|骂声|不走|不高|不是啥好牌子|酸死|destroyed|sh\\*t" \
        "|检举|不能接受批评|没有图片好看|没考虑|overpriced|无法扣住|诡异|走慢|worst|不足|没有选择|非常毒|砲轰|体无完肤|批评|错误|不香|还有天理吗" \
        "|觉得low|嫌弃|滑铁卢|经常断|不好退换|卖不动|don't like|bad taste|不舒适|刮手|伤心|丢人|这么贵|就这样子的吗|停走|唔好提|高不可攀|唔多人买" \
        "|死货|差了|can't stand|确诊|时间慢|涨价|飙涨|比|于|还是|相对|没那么喜欢|直接跳过|有待商榷|嫑"
